//.title
// ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
//
// 🇽🇾🇿 & Dev
//
// Licencing details are in the LICENSE file in the root directory.
//
// ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
//.title~

import '/_common.dart';

// ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░

class WDefaultDialogBody extends StatelessWidget {
  //
  //
  //

  final Widget child;

  //
  //
  //

  const WDefaultDialogBody({
    super.key,
    required this.child,
  });

  //
  //
  //

  @override
  Widget build(BuildContext context) {
    return WSurface(
      child: Padding(
        padding: EdgeInsets.only(
          left: 20.sc,
          right: 20.sc,
          top: 28.sc,
          bottom: 24.sc,
        ),
        child: this.child,
      ),
    );
  }
}
