// //.title
// // ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
// //
// // 🇽🇾🇿 & Dev
// //
// // Licencing details are in the LICENSE file in the root directory.
// //
// // ▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓▓
// //.title~

// import '/_common.dart';

// // ░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░░

// class WHeaderBackButton extends StatelessWidget {
//   //
//   //
//   //

//   final void Function()? onBackButtonPressed;

//   //
//   //
//   //
//   const WHeaderBackButton({
//     super.key,
//     this.onBackButtonPressed,
//   });

//   //
//   //
//   //

//   @override
//   Widget build(BuildContext context) {
//     return Padding(
//       padding: EdgeInsets.all(12.sc),
//       child: Row(
//         children: [
//           IconButton(
//             onTapDown: onBackButtonPressed,
//             icon: Icon(
//               FluentIcons.arrow_left_24_filled,
//               size: 24.sc,
//             ),
//           ),
//         ],
//       ),
//     );
//   }
// }
